Repository: thomiblitz/Java-Geometry-Expert
Catalog: src/main/po/*.po
Languages: fr, pt

source: Last modified on
fr: Dernière modification le
pt: Última modificação em

source: Java version
fr: Version Java
pt: Versão do Java

source: Java Geometry Expert is free under GNU General Public License (GPL).
fr: Java Geometry Expert est gratuit sous la licence publique générale GNU (GPL).
pt: Java Geometry Expert é gratuito de acordo com a licença da GNU Public License (GPL).

source: The user may download and distribute it freely.
fr: L'utilisateur peut le télécharger et le distribuer librement.
pt: O utilizador pode descarregar e distribuir gratuitamente.

source: Authors
fr: Auteurs
pt: Autores

source: For more information, please visit:
fr: Pour plus d'informations, veuillez visiter :
pt: Para obter mais informações, visite:

source: True
fr: Vrai
pt: Verdadeiro

source: False
fr: Faux
pt: Falso

source: Please select
fr: Veuillez sélectionner
pt: Selecionar

source: true
fr: vrai
pt: verdadeiro

source: OK
fr: D'accord

source: Clear
fr: Effacer
pt: Limpar

source: Cancel
fr: Annuler
pt: Cancelar

source: The number of points to be selected:
fr: Le nombre de points à sélectionner :
pt: O número de pontos a serem selecionados:

source: Basic
fr: De base
pt: Básico

source: Color
fr: Couleur
pt: Cor

source: Width
fr: Largeur
pt: Comprimento

source: Line
fr: Ligne
pt: Reta

source: Circle
fr: Cercle
pt: Circunferência

source: Angle Text
fr: Texte d'angle
pt: Etiqueta do ângulo

source: Arc Num
fr: Numéro d'arc
pt: Arco Num

source: Label
fr: Étiquette
pt: Rótulo

source: Show Label
fr: Afficher l'étiquette
pt: Mostrar etiqueta

source: Show Text
fr: Afficher le texte
pt: Mostrar texto

source: Significant Digits
fr: Chiffres significatifs

source: Point number
fr: Numéro de point

source: Draw Line
fr: Dessiner une droite
pt: Desenhar reta

source: Num
fr: Numéro
pt: Número

source: Length
fr: Longueur
pt: Comprimento

source: Polygon
fr: Polygone
pt: Polígono

source: Name
fr: Nom
pt: Nome

source: Radius
fr: Rayon
pt: Raio

source: X Coordinate
fr: Coordonnée X
pt: Abscissa (x)

source: Y Coordinate
fr: Coordonnée Y
pt: Ordenada (y)

source: Frozen
fr: Gelé
pt: Fixar

source: Point on Line
fr: Point sur la ligne
pt: Ponto na reta

source: Point on Circle
fr: Point sur le cercle
pt: Ponto na circunferência

source: Center
fr: Centre
pt: Centro

source: Center X
fr: Centre X
pt: Abscissa do Centro (x)

source: Center Y
fr: Centre Y
pt: Ordenada do Centro (y)

source: Grid Step
fr: Pas de grille

source: Slope Angle
fr: Angle de pente
pt: Ângulo de Inclinação

source: Slope
fr: Pente
pt: Inclinação

source: Save as PS
fr: Enregistrer sous PS
pt: Guardar como PS

source: Gray
fr: Gris
pt: Cinza

source: Black and White
fr: Noir et blanc
pt: Preto e Branco

source: Point filled with background color
fr: Point rempli avec la couleur du fond
pt: Ponto preenchido com a cor de fundo

source: Angle Specification must be done before drawing anything
fr: La spécification de l'angle doit être faite avant de dessiner quoi que ce soit
pt: Deve especificar o ângulo antes de desenhar qualquer coisa

source: Warning
fr: Avertissement

source: The selected two lines don't have intersected point
fr: Les deux lignes sélectionnées n'ont pas de point d'intersection
pt: As duas retas selecionadas não têm um ponto de interseção

source: No intersected point
fr: Pas de point d'intersection
pt: Nenhum ponto de interseção

source: The two lines you selected are parallel, don't have any intersection!
fr: Les deux lignes que vous avez sélectionnées sont parallèles et n'ont aucune intersection !
pt: As retas selecionadas são paralelas, não se intersetam!

source: No intersection
fr: Pas d'intersection
pt: Nenhuma interseção

source: The line and the circle you selected don't have any intersection
fr: La ligne et le cercle que vous avez sélectionnés n'ont aucune intersection
pt: A reta e a circunferência selecionadas não se intersectam

source: The two objects you selected already have two points as their intersections
fr: Les deux objets que vous avez sélectionnés ont déjà deux points comme intersections
pt: Os dois objetos selecionados já se intersetam em dois pontos

source: intersection already defined
fr: intersection déjà définie
pt: interseção já definida

source: The circles you selected don't have any intersection
fr: Les cercles que vous avez sélectionnés n'ont aucune intersection
pt: As circunferências selecionadas não se intersetam

source: Area
fr: Aire
pt: Área

source: Girth
fr: Périmètre
pt: Perímetro

source: Properties
fr: Propriétés
pt: Propriedades

source: File
fr: Fichier
pt: Arquivo

source: New
fr: Nouveau
pt: Novo

source: Open
fr: Ouvrir
pt: Abrir

source: Import
fr: Importer
pt: Importar

source: Save
fr: Sauvegarder
pt: Guardar

source: Save as...
fr: Sauvegarder comme...
pt: Guardar como...

source: Save as Text
fr: Sauvegarder sous forme texte
pt: Guardar como Texto

source: Save as PDF
fr: Sauvegarder en PDF
pt: Guadar como PDF

source: Save as Image
fr: Sauvegarder en format image
pt: Guardar como Imagem

source: Save as Animated Image
fr: Sauvegarder comme image animée
pt: Guardar como Imagem Animada

source: Save Proof as Animated Image
fr: Sauvegarder la preuve comme image animée
pt: Guardar Demonstração como Imagem Animada

source: Save GDD Proof as GraphViz File
fr: Sauvegarder la preuve GDD comme fichier GraphViz
pt: Guardar Demonstração GDD como um ficheiro GraphViz

source: Print
fr: Imprimer
pt: Imprimir

source: Exit
fr: Quitter
pt: Sair

source: Examples
fr: Exemples
pt: Exemplos

source: Construct
fr: Construire
pt: Construir

source: Point by Point and Segment
fr: Point par point et segment

source: Radical of Two Circles
fr: Axe radical de deux cercles
pt: Eixo radical de duas circunferências

source: Oriented Segment
fr: Segment orienté

source: Oriented T Segment
fr: Segment T orienté

source: Oriented Segment * Ratio
fr: Segment orienté * Ratio

source: Other...
fr: Autre...
pt: Outro...

source: Oriented T Segment * Ratio
fr: Segment T orienté * Ratio

source: Proportional Segment
fr: Segment proportionnel

source: Midpoint
fr: Milieu
pt: Ponto médio

source: Circumcenter
fr: Circoncentre
pt: Circuncentro

source: Centroid
fr: Centroïde
pt: Baricentro

source: Orthocenter
fr: Orthocentre
pt: Ortocentro

source: Incenter
fr: Centre du cercle inscrit
pt: Incentro

source: Foot
fr: Pied
pt: Pé da perpendicular

source: Parallel
fr: Parallèle

source: Perpendicular
fr: Perpendiculaire

source: Angle Bisector
fr: Bissectrice d'un angle
pt: Bissetriz

source: Aline
fr: droite A

source: Bline
fr: droite B

source: TCline
fr: droite TC

source: Circle by Three Points
fr: Cercle passant par trois points
pt: Circunferência por três pontos

source: Compass
fr: Compas
pt: Compasso

source: Intersect
fr: Intersecter
pt: Interseção

source: Mirror
fr: transformer par une reflexion
pt: Simetria

source: Isosceles Triangle
fr: Triangle isocèle
pt: Triângulo isósceles

source: Equilateral Triangle
fr: Triangle équilatéral
pt: Triângulo equilátero

source: Right-angled Triangle
fr: Triangle rectangle
pt: Triângulo retângulo

source: Isosceles Right-angled Triangle
fr: Triangle isocèle rectangle
pt: Triângulo retângulo isósceles

source: Quadrangle
fr: Quadrilatère
pt: Quadrilátero

source: Parallelogram
fr: Parallélogramme
pt: Paralelogramo

source: Trapezoid
fr: Trapèze
pt: Trapézio

source: Right-angled Trapezoid
fr: Trapèze rectangle
pt: Trapézio retângulo

source: Square
fr: Carré
pt: Quadrado

source: Pentagon
fr: Pentagone
pt: Pentágono

source: Special Angles
fr: Angle
pt: Ângulos Especiais

source: Constraint
fr: Contrainte
pt: Restrições

source: Eqangle
fr: Angle égale
pt: Equiângulo

source: Eqangle3p
fr: Angle égal 3 points
pt: Equiângulo3p

source: Angle Specification
fr: Spécification d'angle
pt: Ângulo Específico

source: Equal Ratio
fr: Rapport égal
pt: Proporção Igual

source: Equal Distance
fr: Distance égale
pt: Comprimento Igual

source: Ratio Distance
fr: Rapport de distance

source: CCtangent
fr: Tangente CC
pt: Circunferência Tangente

source: Trace
fr: Traçage
pt: Traçar

source: Locus
fr: Lieu
pt: Lugar Geométrico

source: Fill Polygon
fr: Remplir le polygone
pt: Preencher polígono

source: Measure Distance
fr: Mesurer la distance
pt: Medir distância

source: Arrow
fr: Flèche
pt: Vetor

source: Equal Mark
fr: Marque égale
pt: Marca Igual

source: Right-angle Mark
fr: Marque d'angle droit
pt: Marca de ângulo reto

source: Calculation
fr: Calcul
pt: Cálculo

source: Hide Object
fr: Cacher l'objet
pt: Ocultar objeto

source: Show Object
fr: Afficher l'objet
pt: Mostrar objeto

source: Transform
fr: Transformer
pt: Trasformar

source: Equivalence
fr: Équivalence
pt: Equivalência

source: Free Transform
fr: Transformation libre
pt: Transformação livre

source: Lemmas
fr: Lemmes
pt: Lemas

source: Rules for Full Angle
fr: Règles pour l'angle plein
pt: Regras para o Ângulo Completo

source: Rules for GDD
fr: Règles pour GDD
pt: Regras para GDD

source: Preferences
fr: Préférences
pt: Preferências

source: Construct History
fr: Historique de construction
pt: Histórico da construção

source: Show Step Bar
fr: Afficher la barre d'étapes
pt: Mostrar barra de passo a passo

source: Style Dialog
fr: Dialogue de style
pt: Estilo de diálogo

source: Help
fr: Aide
pt: Ajuda

source: Help on Mode
fr: Aide sur le mode
pt: Ajuda sobre a ferramenta

source: JGEX Homepage
fr: Page d'accueil de JGEX
pt: Homepage do JGEX

source: Contact Us
fr: Nous contacter
pt: Contato

source: About JGEX
fr: À propos de JGEX
pt: Sobre JGEX

source: Move
fr: Déplacer
pt: Mover

source: Select
fr: Sélectionner
pt: Selecionar

source: Please input the value of the angle
fr: Veuillez entrer la valeur de l'angle
pt: Insira o valor do ângulo

source: Nothing to be saved.
fr: Rien à sauvegarder.
pt: Não há nada a guardar.

source: The diagram has been changed, do you want to save it?
fr: Le diagramme a été modifié, voulez-vous le sauvegarder?
pt: A figura foi alterada, deseja guardá-la?

source: File exists
fr: Le fichier existe déjà
pt: Ficheiro já existe

source: No animation has been defined.
fr: Aucune animation n'a été définie.
pt: Não foi definida qualquer animação.

source: GIF Option
fr: Option GIF
pt: Opção GIF

source: Image Quality
fr: Qualité de l'image
pt: Qualidade da Imagem

source: Best
fr: Meilleur
pt: Ótima

source: Good
fr: Bon
pt: Boa

source: Medium
fr: Moyen
pt: Média

source: Low
fr: Faible
pt: Baixa

source: Very Low
fr: Très faible
pt: Muito baixa

source: sangle
fr: angle

source: Online Help
fr: Aide en ligne
pt: Ajuda online

source: Check for Update
fr: Vérifier les mises à jour
pt: Verificar atualização

source: Algebraic Translation
fr: Traduction algébrique
pt: Tradução Algébrica

source: Reduce
fr: Réduire
pt: Reduzir

source: Details
fr: Détails
pt: Detalhes

source: Reload
fr: Recharger
pt: Recarregar

source: Close
fr: Fermer
pt: Fechar

source: Polynomial
fr: Polynôme
pt: Polinómio

source: Cut
fr: Couper
pt: Cortar

source: Copy
fr: Copier
pt: Copiar

source: Paste
fr: Coller
pt: Colar

source: Delete
fr: Supprimer
pt: Cancelar

source: Objects
fr: Objets
pt: Objetos

source: Display
fr: Affichage

source: Font
fr: Police
pt: Fontes

source: Other
fr: Autre
pt: Outro

source: Save Preferences
fr: Enregistrer les préférences
pt: Guardar preferências

source: Default
fr: Par défaut

source: Can not save Preferences
fr: Impossible d'enregistrer les préférences
pt: Impossível guardar as Preferências

source: Preferences have been successfully saved.
fr: Les préférences ont été enregistrées avec succès.
pt: As Preferências foram guardadas com sucesso.

source: Please restart the program.
fr: Veuillez redémarrer le programme.
pt: Reinicie o programa.

source: Saved
fr: Enregistré
pt: Guardado

source: Point's Text
fr: Texte du point
pt: Texto dos pontos

source: Default Font
fr: Police par défaut
pt: Fonte padrão

source: Choose default font for point's text
fr: Choisissez la police par défaut pour le texte du point
pt: Escolha o tipo de letra padrão para a legenda do ponto

source: None
fr: Aucun
pt: Nenhum

source: Degrees
fr: Degrés
pt: Graus

source: Foot Mark
fr: Marque de pied
pt: Marca do pé da perpendicular

source: Show foot mark
fr: Afficher le pied
pt: Mostrar marca do pé da perpendicular

source: Without Arrow
fr: Sans flèche
pt: Sem vetor

source: With Arrow
fr: Avec flèche
pt: Com vetor

source: Multiple Arc
fr: Arc multiple
pt: Arco múltiplo

source: Fill
fr: Remplir
pt: Preencher

source: Polygon Moving Interval
fr: Intervalle de déplacement du polygone
pt: Intervalo de movimento do polígono

source: Theorem
fr: Théorème
pt: Teorema

source: Area Method
fr: Méthode de l'aire
pt: Método da Área

source: Area Method computations
fr: Calculs de la méthode de l'aire
pt: Cálculos do Método da Área

source: Manual proof editor
fr: Éditeur de preuve manuelle

source: Manual Method
fr: Méthode manuelle
pt: Método manual

source: Deduction tree of the GDD method
fr: Arbre de déduction de la méthode GDD
pt: Árvore de dedução do método GDD

source: Algebraic computations for Wu's method
fr: Calculs algébriques pour la méthode de Wu
pt: Cálculos algébricos para o método de Wu

source: Algebraic computations for the Groebner basis method
fr: Calculs algébriques pour la méthode des bases de Groebner
pt: Cálculos algébricos para o método da base de Groebner

source: Derivation for the Full Angle method
fr: Dérivation pour la méthode de l'angle plein
pt: Derivação usando o Método do Ângulo Completo

source: Show the internal description of the construction
fr: Afficher la description interne de la construction
pt: Mostrar a descrição interna da construção

source: Show general properties that seem to be true
fr: Afficher les propriétés générales qui semblent être vraies
pt: Mostrar propriedades gerais que parecem ser verdadeiras

source: Fixpoint
fr: Point fixe
pt: Ponto fixo

source: Algebra
fr: Algèbre
pt: Álgebra

source: Color Mode
fr: Mode couleur
pt: Modo de cor

source: Colorful
fr: Coloré
pt: Colorido

source: Grid
fr: Grille

source: Choose Color
fr: Choisir la couleur
pt: Escolher cor

source: ON
fr: ACTIVÉ

source: OFF
fr: DÉSACTIVÉ

source: Language
fr: Langue
pt: Idioma

source: LookAndFeel
fr: Apparence

source: Edit
fr: Éditer
pt: Editar

source: Add
fr: Ajouter
pt: Adicionar

source: Append
fr: Ajouter à la fin

source: Child
fr: Enfant
pt: Criança

source: Basic Assertions
fr: Assertions de base
pt: Afirmações básicas

source: Polygon Related
fr: Relatif au polygone
pt: Polígono referido

source: Inequality
fr: Inégalité
pt: Desigualdade

source: Delete this row
fr: Supprimer cette ligne
pt: Apagar esta linha

source: Add a new row
fr: Ajouter une nouvelle ligne
pt: Adicionar uma linha

source: Append a term
fr: Ajouter un terme
pt: Anexar um termo

source: Combine selected rows
fr: Combiner les lignes sélectionnées
pt: Combinar as linhas selecionadas

source: Nondegenerate Conditions
fr: Conditions non dégénérées
pt: Condições não degeneradas

source: The Simplified Nondegenerate Conditions
fr: Les conditions non dégénérées simplifiées
pt: As condições simplificadas não degeneradas

source: The Final Nondegenerate Conditions
fr: Les conditions non dégénérées finales
pt: As condições finais não degeneradas

source: Nondegenerate Condition
fr: Condition non dégénérée
pt: Condição não degenerada

source: Numerical Check
fr: Vérification numérique
pt: Verificação Numérica

source: TRUE
fr: VRAI
pt: VERDADEIRO

source: FALSE
fr: FAUX
pt: FALSO

source: The Algebraic Form:
fr: La forme algébrique :
pt: A forma algébrica:

source: The Nondegenerate Conditions:
fr: Les conditions non dégénérées :
pt: As condições de não degenerescência:

source: The Initial Polynomial Set:
fr: L'ensemble de polynômes initial :
pt: O conjunto inicial de polinómios:

source: The Groebner basis:
fr: La base de Groebner :
pt: A Base de Groebner:

source: The conclusion:
fr: La conclusion :
pt: A conclusão:

source: The conclusion after reduce:
fr: La conclusion après réduction :
pt: A conclusão após a redução:

source: The conclusion is true
fr: La conclusion est vraie
pt: A conclusão é verdadeira

source: The conclusion is false
fr: La conclusion est fausse
pt: A conclusão é falsa

source: Search facts
fr: Rechercher des faits
pt: Pesquisar fatos

source: Add Conclusion
fr: Ajouter une conclusion
pt: Adicionar conclusão

source: Time:
fr: Temps :
pt: Tempo:

source: second(s)
fr: seconde(s)
pt: segundo(s)

source: lines
fr: lignes
pt: retas

source: parallel lines
fr: lignes parallèles
pt: retas paralelas

source: perpendicular lines
fr: lignes perpendiculaires
pt: retas perpendiculares

source: midpoints
fr: milieux
pt: pontos médios

source: circles
fr: cercles
pt: circunferências

source: congruent segments
fr: segments congrus
pt: segmentos congruentes

source: congruent angles
fr: angles congrus
pt: ângulos congruentes

source: similiar triangles
fr: triangles semblables
pt: triângulos semelhantes

source: congruent triangles
fr: triangles congruents (triangles égaux)
pt: triângulos congruentes

source: special angles
fr: angles spéciaux
pt: ângulos especiais

source: perp-acong angles
fr: angles perpendiculaires-aigus
pt: ângulos perp-acong

source: ratio segments
fr: segments de rapport
pt: segmentos proporcionais

source: Can not find any proof!
fr: Impossible de trouver une preuve !
pt: Não foi possível encontrar uma demonstração!

source: Not Found
fr: Non trouvé

source: No conclusion has been set!
fr: Aucune conclusion n'a été définie !
pt: Nenhuma conclusão foi definida!

source: No conclusion
fr: Pas de conclusion
pt: Sem conclusão

source: Please construct the diagram first!
fr: Veuillez construire le diagramme d'abord !
pt: Por favor, desenhe a figura primeiro!

source: Diagram not completed
fr: Diagramme non terminé
pt: Figura incompleta

source: {0} is trivially true
fr: {0} est trivialement vrai
pt: {0} é trivialmente verdadeiro

source: {0} is obviously true (by hypothesis)
fr: {0} est évidemment vrai (par hypothèse)
pt: {0} é obviamente verdadeiro (por hipótese)

source: Can not prove this theorem
fr: Impossible de prouver ce théorème
pt: Não é possível provar este teorema

source: Show Detail
fr: Afficher les détails
pt: Mostrar detalhes

source: Failed
fr: Échec
pt: Falhou

source: The conclusion can not be translated to full-angle expression.
fr: La conclusion ne peut pas être traduite en expression d'angle complet.
pt: A conclusão não pode ser traduzida numa expressão de ângulo completo.

source: Not Supported
fr: Non pris en charge
pt: Não suportado

source: Prove
fr: Prouver
pt: Demonstrar

source: Prove in a new tab
fr: Prouver dans un nouvel onglet
pt: Demonstrar num novo separador

source: Refresh
fr: Rafraîchir
pt: Atualizar

source: Search a fact
fr: Rechercher un fait
pt: Procurar um dado fato

source: File format not supported!
fr: Format de fichier non supporté!
pt: Formato de ficheiro não compatível!

source: Can not open
fr: Impossible d'ouvrir
pt: Não é possível abrir

source: Deductive Database Method
fr: Méthode de base de données déductive
pt: Método das bases de dados dedutivas

source: Full Angle Method
fr: Méthode d'angle complet
pt: Método de ângulo completo

source: Traditional Method
fr: Méthode traditionnelle
pt: Método tradicional

source: Wu's Method
fr: Méthode de Wu
pt: Método de Wu

source: To Prove
fr: À prouver
pt: Para demonstrar

source: Polynomials
fr: Polynômes
pt: Polinómios

source: All solutions
fr: Toutes les solutions
pt: Todas as soluções

source: Remainder
fr: Reste
pt: Resto

source: The Triangulized Hypotheses:
fr: Les hypothèses triangulisées :
pt: As hipóteses triangularizadas:

source: Successive Pseudo Remainder of the conclusion wrt Triangulized Hypotheses:
fr: Le reste pseudo successif de la conclusion par rapport aux hypothèses triangulisées :
pt: Sucessivos pseudo restos da conclusão com respeito à triangularização das hipóteses:

source: System Run Out Of Memory
fr: La mémoire du système est épuisée
pt: O sistema ficou sem memória

source: The Theorem Is Not Proved!
fr: Le théorème n'est pas prouvé !
pt: O teorema não foi provado!

source: The conclusion is not proved
fr: La conclusion n'est pas prouvée
pt: A conclusão não foi provada

source: Set the ratio
fr: Définissez le ratio
pt: Definir a proporção

source: Please input two integers
fr: Veuillez saisir deux entiers
pt: Insira dois inteiros

source: Please choose the client area
fr: Veuillez choisir la zone client
pt: Escolha a área do cliente

source: Cancel Action
fr: Annuler l'action
pt: Anular ação

source: Edit Text
fr: Éditer le texte
pt: Editar texto

source: Freeze
fr: Geler
pt: Fixar

source: Unfreeze
fr: Débloquer

source: Stop Trace
fr: Arrêter la trace
pt: Parar traço

source: Plain
fr: Normal

source: Bold
fr: Gras
pt: Negrito

source: because
fr: parce que

source: Text
fr: Texte
pt: Texto

source: Data
fr: Données

source: Function
fr: Fonction
pt: Função

source: Coordinates
fr: Coordonnées
pt: Coordenadas

source: Connection failed: Please check your network connection and try again.
fr: La connexion a échoué : Veuillez vérifier votre connexion réseau et réessayer.
pt: A ligação falhou: Por favor verifique a sua ligação de rede e tente novamente.

source: Connection failed
fr: La connexion a échoué
pt: Falha na ligação

source: Update Information
fr: Informations de mise à jour
pt: Atualizar informações

source: A new version is available on the server, do you want to update?
fr: Une nouvelle version est disponible sur le serveur, voulez-vous mettre à jour ?
pt: Nova versão disponível no servidor, deseja atualizar agora?

source: Your current JGEX version
fr: Votre version actuelle de JGEX
pt: Versão JGEX atual

source: Available JGEX version
fr: Version JGEX disponible
pt: Versão JGEX disponível

source: Press OK to update.
fr: Appuyez sur OK pour mettre à jour.
pt: Pressione OK para atualizar.

source: JGEX Update
fr: Mise à jour de JGEX
pt: Atualização JGEX

source: Hide
fr: Cacher
pt: Ocultar

source: File downloaded! To update JGEX, the program will exit and restart
fr: Le fichier a été téléchargé ! Pour mettre à jour JGEX, le programme va quitter et redémarrer
pt: Ficheiro obtido! Para atualizar o JGEx, o programa vai reiniciar

source: by HYP
fr: par HYP
pt: por hipótese

source: in GIB
fr: dans GIB
pt: em GIB

source: Font Chooser
fr: Sélecteur de police
pt: Escolher Tipo de Letra

source: Italic
fr: Italique
pt: Itálico

source: Underline
fr: Souligné
pt: Sublinhado

source: Strikethrough
fr: Barré
pt: Riscado

source: Subscript
fr: Indice
pt: Subscrito

source: Superscript
fr: Exposant
pt: Sobrescrito

source: Preview Font
fr: Aperçu de police

source: Font name
fr: Nom de police
pt: Nome do tipo de letra

source: Font size
fr: Taille de police
pt: Tamanho da letra

source: Effects
fr: Effets
pt: Efeitos

source: Font color
fr: Couleur de police
pt: Cor da letra

source: Preview
fr: Aperçu

source: Save and exit
fr: Enregistrer et quitter
pt: Guardar e sair

source: Exit without save
fr: Quitter sans enregistrer
pt: Sair sem guardar

source: Start the animation
fr: Démarrer l'animation
pt: Iniciar a animação

source: Pause the animation
fr: Mettre en pause l'animation
pt: Pausa na animação

source: Stop the animation
fr: Arrêter l'animation
pt: Parar a animação

source: Print the client area
fr: Imprimer la zone client
pt: Imprimir a área do cliente

source: Click three points A, B, C, then click a point D on an object to get AB = CD
fr: Cliquez sur trois points A, B, C, puis cliquez sur un point D sur un objet pour obtenir AB = CD

source: Click two circles to construct their radical axis
fr: Cliquez sur deux cercles pour construire leur axe radical
pt: Selecionar duas circunferências para construir o seu eixo radical
