Repository: thomiblitz/Java-Geometry-Expert
Catalog: src/main/po/*.po
Languages: fr, pt

source: If triangle ABE is a right triangle and O is the midpoint of the hypotenuse (i.e. AB), then for any line CD, we have ∠[AB, CD] = ∠[BAE] + ∠[1] + ∠[BE, CD].
fr: Si le triangle ABE est un triangle rectangle et O est le milieu de l'hypoténuse (c'est-à-dire AB), alors pour toute droite CD, nous avons ∠[AB, CD] = ∠[BAE] + ∠[1] + ∠[BE, CD].
pt: Se o triângulo ABE é retângulo e O é o ponto médio da hipotenusa (i.e. AB), então para qualquer reta CD, tem-se ∠[AB, CD] = ∠[BAE] + ∠[1] + ∠[BE, CD].

source: For a circle (O,ABC) and D is midpoint of BC, we have ∠[AB, EF] = ∠[BOD] + ∠[AC, EF].
fr: Pour un cercle (O,ABC) et D est le milieu de BC, nous avons ∠[AB, EF] = ∠[BOD] + ∠[AC, EF].
pt: Dada uma circunferência (O,ABC) e D é o ponto médio de BC, tem-se ∠[AB, EF] = ∠[BOD] + ∠[AC, EF].

source: For a circle (O,ABF), if E is the midpoint of AF, we have ∠[AB, CD] = ∠[EOA] + ∠[BF, CD].
fr: Pour un cercle (O,ABF), si E est le milieu de AF, nous avons ∠[AB, CD] = ∠[EOA] + ∠[BF, CD].
pt: Dada uma circunferência (O,ABF), se E é o ponto médio de AF, tem-se ∠[AB, CD] = ∠[EOA] + ∠[BF, CD].

source: If G is the orthocenter of ABC, ∠[AE, HI] = ∠[AE, BE] + ∠[BE, HI] = ∠[1] + ∠[BE, HI].
fr: Si G est l'orthocentre de ABC, ∠[AE, HI] = ∠[AE, BE] + ∠[BE, HI] = ∠[1] + ∠[BE, HI].
pt: Se G é o ortocentro de ABC, ∠[AE, HI] = ∠[AE, BE] + ∠[BE, HI] = ∠[1] + ∠[BE, HI].

source: If A is the incenter of P2KI, ∠[AB, CD] = ∠[AB, BK] + ∠[BK, CD] = ∠[1] + ∠[KI, KA] + ∠[IA, IK] + ∠[BK, CD].
fr: Si A est le centre de P2KI, ∠[AB, CD] = ∠[AB, BK] + ∠[BK, CD] = ∠[1] + ∠[KI, KA] + ∠[IA, IK] + ∠[BK, CD].
pt: Se A é o incentro de P2KI, ∠[AB, CD] = ∠[AB, BK] + ∠[BK, CD] = ∠[1] + ∠[KI, KA] + ∠[IA, IK] + ∠[BK, CD].

source: Equal angle found in the Geometry Deductive Database.
fr: Angle égal trouvé dans la base de données déductive de géométrie.

source: If AB ⊥ AC and AB = AC, then ∠[AB,AC] = 2 · ∠[AB,BC].
fr: Si AB ⊥ AC et AB = AC, alors ∠[AB,AC] = 2 · ∠[AB,BC].
pt: Se AB ⊥ AC e AB = AC, então ∠[AB,AC] = 2 · ∠[AB,BC].

source: If AB ⊥ AC and AB = AC, then 2 · ∠[AB,DE] = 2 · ∠[AB,BC] + 2 · ∠[BC,DE] = ∠[1] + 2 · ∠[BC,DE].
fr: Si AB ⊥ AC et AB = AC, alors 2 · ∠[AB,DE] = 2 · ∠[AB,BC] + 2 · ∠[BC,DE] = ∠[1] + 2 · ∠[BC,DE].
pt: Se AB ⊥ AC e AB = AC, então 2 · ∠[AB,DE] = 2 · ∠[AB,BC] + 2 · ∠[BC,DE] = ∠[1] + 2 · ∠[BC,DE].

source: If OB // DE and A is on the circle (O,B), then 2 · ∠[AB, DE] = ∠[OA,OB].
fr: Si OB est parallèle à DE et A est sur le cercle (O,B), alors 2 · ∠[AB, DE] = ∠[OA,OB].
pt: Se OB // DE e A pertence à circunferência (O,B), então 2 · ∠[AB, DE] = ∠[OA,OB].

source: A is on circle (O,B), then 2 · ∠[AB, DE] = ∠[OA,OB] + 2 · ∠[OA,DE].
fr: A est sur le cercle (O,B), alors 2 · ∠[AB, DE] = ∠[OA,OB] + 2 · ∠[OA,DE].
pt: A pertence à circunferência (O,B), então 2 · ∠[AB, DE] = ∠[OA,OB] + 2 · ∠[OA,DE].

source: CD is the diameter of a circle (A,BCD), AB ⊥ CD, then 2 · ∠[DB,BA] = ∠[1].
fr: CD est le diamètre du cercle (A,BCD), AB ⊥ CD, alors 2 · ∠[DB,BA] = ∠[1].
pt: CD é um diâmetro de uma circunferência (A,BCD), AB ⊥ CD, então 2 · ∠[DB,BA] = ∠[1].

source: A, B, C, D, E are concyclic and AC = AD, then 2 · ∠[AB, BC] = ∠[CE, ED].
fr: A, B, C, D, E sont concycliques et AC = AD, alors 2 · ∠[AB, BC] = ∠[CE, ED].
pt: A, B, C, D, E são concíclicos e AC = AD, então 2 · ∠[AB, BC] = ∠[CE, ED].

source: If A, B, E, F, G are concyclic and AE = AF, then 2 · ∠[AB, CD] = 2 · ∠[BE, CD] + ∠[EG, GF].
fr: Si A, B, E, F, G sont concycliques et AE = AF, alors 2 · ∠[AB, CD] = 2 · ∠[BE, CD] + ∠[EG, GF].

source: If AB = AC = BC, i.e., triangle ABC is an equilateral triangle, then 3 · ∠[AB, BC] = ∠[0].
fr: Si AB = AC = BC, c'est-à-dire que le triangle ABC est un triangle équilatéral, alors 3 · ∠[AB, BC] = ∠[0].
pt: Se AB = AC = BC, i.e., o triângulo ABC é um triângulo equilátero, então 3 · ∠[AB, BC] = ∠[0].

source: Full Rules
fr: Règles Complètes
pt: Regras completas

source: Save as Maple Format
fr: Enregistrer au format Maple

source: The point should be a fix point.
fr: Le point devrait être un point fixe.
pt: O ponto deve ser um ponto fixo.

source: Please select the second point.
fr: Veuillez sélectionner le deuxième point.
pt: Por favor selecione o segundo ponto.

source: Please select a line or a circle.
fr: Veuillez sélectionner une droite ou un cercle.
pt: Por favor selecione uma reta ou uma circunferência.

source: Expand/collapse proof tree
fr: Développer/replier l'arbre de preuve

source: Compute proof with the selected method
fr: Calculer la preuve avec la méthode sélectionnée

source: Failed to prove this theorem with Deductive Database Method.
fr: Impossible de prouver ce théorème avec la méthode de base de données déductive.

source: Which?
fr: Lequel?

source: GBasis is Running
fr: GBasis est en cours d'exécution

source: The Process Is Stopped By The User.
fr: Le processus est arrêté par l'utilisateur.
pt: O Processo foi interrompido pelo utilizador.

source: seconds
fr: secondes
pt: segundos

source: AAA
fr: Similarité (angle-angle-angle).

source: by Rule?
fr: par règle?
pt: pela regra?

source: by {0}
fr: par {0}
pt: por {0}

source: Middle Point
fr: Point Milieu
pt: Ponto médio

source: View Remainder
fr: Voir le reste

source: Current Solution:
fr: Solution actuelle :
pt: Solução atual:

source: Filter
fr: Filtre
pt: Filtrar

source: Choose a rectangle
fr: Choisissez un rectangle
pt: Escolha um retângulo

source: Saving Proof as GIF File
fr: Enregistrement de la preuve au format GIF
pt: Guardar Demonstração como um ficheiro GIF

source: Default Delay
fr: Retard par défaut

source: Delay at Begin
fr: Retard au début

source: Delay at End
fr: Retard à la fin

source: Look in:
fr: Rechercher dans :
pt: Procurar em:

source: File name:
fr: Nom de fichier :
pt: Nome do ficheiro:

source: Files of type:
fr: Fichiers de type :
pt: Ficheiro do tipo:

source: Save in:
fr: Sauvergarder dans :
pt: Guardar em:

source: Save As
fr: Sauvegarder comme
pt: Guardar como

source: All Files
fr: Tous les fichiers
pt: Todos os ficheiros

source: The diagram is frozen, use right click menu to unfreeze!
fr: Le diagramme est gelé, utilisez le menu clic droit pour dégeler!

source: Open selected file
fr: Ouvrir le fichier sélectionné
pt: Abrir ficheiro selecionado

source: Abort file chooser dialog
fr: Annuler la boîte de dialogue de sélection de fichiers

source: Up One Level
fr: Niveau supérieur
pt: Subir um nível

source: Home
fr: Accueil

source: Create New Folder
fr: Créer un nouveau dossier
pt: Criar uma nova Pasta

source: List
fr: Liste
pt: Lista

source: Size
fr: Taille
pt: Tamanho

source: Date Modified
fr: Date de modification
pt: Data de alteração

source: Set One
pt: Selecione um

source: Set Two
pt: Selecione dois

source: Type
pt: Tipo

source: Point
pt: Ponto

source: Angle
pt: Ângulo

source: Intersection
pt: Interseção

source: Action
pt: Ação

source: Triangle
pt: Triângulo

source: Rectangle
pt: Retângulo

source: Rectangle {0}
pt: Retângulo {0}

source: Animation
pt: Animação

source: Rules for the Full Angle Method
pt: Regras para o Método do Ângulo Completo

source: Rules for the GDD Method
pt: Regras para o Método GDD

source: Options
pt: Opções

source: Variables
pt: Variáveis

source: Variable
pt: Variável

source: Mode
pt: Modo

source: Radius of Point
pt: Raio do ponto

source: Construction
pt: Construção

source: Message
pt: Messagem

source: Information
pt: Informação

source: Pause
pt: Pausa

source: stop
pt: parar

source: point
pt: ponto

source: angle
pt: ângulo

source: segment
pt: segmento

source: triangle
pt: triângulo

source: rectangle
pt: retângulo

source: Assertion
pt: Afirmação

source: Congruent
pt: Congruente

source: Version
pt: Versão

source: type
pt: tipo

source: Point {0}
pt: Ponto {0}

source: parallel to {0} passing {1}
pt: paralelo a {0} passando por {1}

source: passing {0}
pt: passando por {0}

source: Triangle {0}
pt: Triângulo {0}

source: Segment
pt: Segmento
