Repository: thomiblitz/Java-Geometry-Expert
Catalog: src/main/po/*.po
Languages: fr, pt

source: Click two points A, B, then a point C to get AB //= CD
fr: Cliquez sur deux points A, B, puis un point C pour obtenir AB //= CD
pt: Selecionar dois pontos A, B, e depois um ponto C para obter AB //= CD

source: Click two points A, B, then point C to get CD equal and perpendicular to +- AB
fr: Cliquez sur deux points A, B, puis le point C pour obtenir CD égal et perpendiculaire à +- AB
pt: Selecionar dois pontos A, B, depois o ponto C para obter CD igual e perpendicular a +- AB

source: Input your own ratio
fr: Entrez votre propre rapport
pt: Introduzir a sua razão

source: Click two points to get a point with ratio {0}
fr: Cliquez sur deux points pour obtenir un point avec un rapport de {0}
pt: Selecionar dois pontos para obter um ponto com razão {0}

source: Add a single point
fr: Ajouter un point unique
pt: Adicionar um único ponto

source: Click two points to get their midpoint
fr: Cliquez sur deux points pour obtenir leur point milieu
pt: Selecionar dois pontos para obter o seu ponto médio

source: Construct the circumcenter by selecting three points
fr: Construisez le centre circonscrit en sélectionnant trois points
pt: Construir o circuncentro selecionando três pontos

source: Construct the centroid by clicking three points
fr: Construisez le centre de gravité en cliquant sur trois points
pt: Construir o baricentro selecionando três pontos

source: Construct the orthocenter by clicking three points
fr: Construisez le centre orthocentre en cliquant sur trois points
pt: Construir o ortocentro selecionando três pontos

source: Construct the incenter by clicking three points
fr: Construisez le centre inscrit en cliquant sur trois points
pt: Construir o incentro selecionando três pontos

source: Click a point then drag to a line to construct the foot
fr: Cliquez sur un point puis faites glisser jusqu'à une ligne pour construire le pied
pt: Selecionar um ponto e depois arraste-o para uma reta para construir o pé da perpendicular

source: Draw a line by connecting two points
fr: Dessinez une ligne en reliant deux points
pt: Desenhar uma reta ligando dois pontos

source: Parallel Line
fr: Ligne parallèle
pt: Reta paralela

source: parallel line
fr: ligne parallèle
pt: reta paralela

source: Perpendicular Line
fr: Ligne perpendiculaire
pt: Reta Perpendicular

source: perpendicular line
fr: ligne perpendiculaire
pt: reta perpendicular

source: Draw an angle bisector
fr: Dessinez une bissectrice d'angle
pt: Desenhar a bissetriz de um ângulo

source: Draw Aline
fr: Dessinez une ligne

source: Perp-Bisect Line
fr: Ligne bissectrice perpendiculaire
pt: Mediatriz do Segmento

source: Tangent Line
fr: Ligne tangente
pt: Reta tangente

source: Draw a circle by a center point and a point on circle
fr: Dessinez un cercle par un point central et un point sur le cercle
pt: Desenhar uma circunferência dado o centro e um ponto da circunferência

source: Circle by Radius
fr: Cercle par rayon

source: Intersect to decide a point
fr: Intersectez pour décider d'un point

source: Mirror an element with respect to a line or a point
fr: Réfléchir un élément par rapport à une ligne ou un point
pt: Simetria de um elemento relativamente a uma reta ou um ponto

source: Draw a triangle
fr: Dessiner un triangle
pt: Desenhar um triângulo

source: Draw an isosceles triangle
fr: Dessiner un triangle isocèle
pt: Desenhar um triângulo isósceles

source: Draw an equilateral triangle
fr: Dessiner un triangle équilateral
pt: Desenhar um triângulo equilátero

source: Draw a right-angled triangle
fr: Dessiner un triangle rectangle
pt: Desenhar um triângulo retêngulo

source: Draw an isosceles right-angled triangle
fr: Dessiner un triangle isocèle rectangle
pt: Desenhar um triângulo retângulo isósceles

source: Draw a quadrangle
fr: Dessiner un quadrilatère
pt: Desenhar um quadrângulo

source: Draw a parallelogram
fr: Dessiner un parallélogramme
pt: Desenhar um paralelogramo

source: Draw a trapezoid
fr: Dessiner un trapèze
pt: Desenhar um trapézio

source: Draw a right angle trapezoid
fr: Dessiner un trapèze rectangle
pt: Desenhar um trapézio retângulo

source: Draw a rectangle
fr: Dessiner un rectangle
pt: Desenhar um retângulo

source: Draw a square
fr: Dessiner un carré
pt: Desenhar um quadrado

source: Draw a pentagon
fr: Dessiner un pentagone
pt: Desenhar um pentágono

source: Draw a polygon
fr: Dessiner un polygone
pt: Desenhar um polígono

source: Draw an angle of {0} degrees
fr: Dessiner un angle de {0} degrés
pt: Desenhar um ângulo de {0} graus

source: Draw an angle of other degrees
fr: Dessiner un angle de degrés autre
pt: Desenhar um ângulo de outros graus

source: Set two angles equal
fr: Définir deux angles égaux

source: Set the sum of three angles equal to one
fr: Définir la somme de trois angles égale à un
pt: Definir a soma de três ângulos igual a um

source: Set specific angles of system
fr: Définir des angles spécifiques du système
pt: Definir ângulos específicos do sistema

source: Select four segments to set their equal ratio
fr: Sélectionner quatre segments pour définir leur rapport égal

source: Set two segments to be equal
fr: Définir deux segments égaux

source: Set two segments to have ratio: {0}
fr: Définir deux segments ayant un rapport de {0}

source: Set two segments to have specified ratio
fr: Définir deux segments ayant un rapport spécifié

source: Set two circles to be tangent
fr: Définir deux cercles tangents

source: Select a point to trace its locus (in combination with move or animation)
fr: Sélectionner un point pour tracer sa trajectoire (en combinaison avec le déplacement ou l'animation)
pt: Selecionar um ponto para

source: The locus of a point
fr: La trajectoire d'un point
pt: O lugar geométrico de um ponto

source: Click a point then an object to animate
fr: Cliquez sur un point puis sur un objet pour animer

source: select a closed segment path to fill the polygon
fr: sélectionnez un chemin de segment fermé pour remplir le polygone

source: Select two angle to set equal
fr: Sélectionnez deux angles pour les égaler

source: Select two points to construct an arrow
fr: Sélectionnez deux points pour construire une flèche
pt: Selecionar dois pontos para construir um vetor

source: Mark for equal with one line
fr: Marquer pour égal avec une ligne

source: Mark for equal with two lines
fr: Marquer pour égal avec deux lignes

source: Mark for equal with three lines
fr: Marquer pour égal avec trois lignes

source: Mark for equal with four lines
fr: Marquer pour égal avec quatre lignes

source: Draw a right angle mark
fr: Dessinez une marque d'angle droit
pt: Desenhar uma marca de ângulo reto

source: Hide objects
fr: Cacher les objets
pt: Ocultar objetos

source: Show objects that is hiden
fr: Afficher les objets cachés
pt: Mostrar objetos que estão ocultos

source: Transform polygon
fr: Transformer le polygone

source: Equivalence transform polygon
fr: Transformer le polygone par équivalence

source: Transform polygon freely
fr: Transformer le polygone librement
pt: Transformar polígono livremente

source: Set the default property
fr: Définir la propriété par défaut

source: Edit construct history
fr: Éditer l'historique de construction
pt: Editar o histórico da construção

source: Show Step Bar for prove
fr: Afficher la barre d'étapes pour la preuve
pt: Mostrar a barra e passo a passo, da demonstração

source: Show Draw Style Dialog
fr: Afficher la boîte de dialogue du style de dessin

source: About Java Geometry Expert
fr: À propos de Java Geometry Expert
pt: Acerca de Java Geometry Expert

source: construct history
fr: historique de construction
pt: histórico da construção

source: translate view
fr: traduire la vue
pt: vista com tradução

source: zoom in view
fr: zoom avant dans la vue
pt: vista ampliada

source: zoom out view
fr: zoom arrière dans la vue
pt: vista reduzida

source: snap to grid
fr: accrocher à la grille

source: draw the rectangle grid
fr: dessiner la grille rectangulaire

source: make the grid less dense
fr: rendre la grille moins dense
pt: tornar a grelha menos apertada

source: make the grid more dense
fr: rendre la grille plus dense
pt: tornar a grelha mais apertada

source: redo a step
fr: refaire une étape
pt: refazer um passo

source: undo a step
fr: annuler une étape
pt: desfazer um passo

source: forward to end
fr: aller à la fin

source: back to start
fr: revenir au début

source: auto show draw step by step
fr: afficher étape par étape automatiquement

source: Create a new view
fr: Créer une nouvelle vue

source: Open a file
fr: Ouvrir un fichier
pt: Abrir um ficheiro

source: Save to a file
fr: Enregistrer dans un fichier
pt: Guardar num ficheiro

source: Select mode
fr: Sélectionner le mode
pt: Selecionar modo

source: Select two points to construct a line
fr: Sélectionner deux points pour construire une droite
pt: Selecionar dois pontos para construir uma reta

source: Draw a line which is parallel to another line
fr: Dessiner une ligne parallèle à une autre ligne
pt: Desenhar uma reta que é paralela a outra reta

source: Select a point and a line to construct the foot
fr: Sélectionner un point et une ligne pour construire le pied
pt: Selecionar um ponto e uma reta para construir o pé da perpendicular

source: Draw two points and a circle
fr: Dessiner deux points et un cercle
pt: Desenhar dois pontos e uma circunferência

source: Select three points to construct the circle passing through them
fr: Sélectionner trois points pour construire le cercle passant par eux
pt: Selecionar três pontos para construir a circunferência que os contém

source: Draw a circle with center and radius
fr: Dessiner un cercle avec centre et rayon
pt: Desenhar uma circunferência dado o centro e raio

source: Define a polygon
fr: Définir un polygone
pt: Definir um polígono

source: Select two lines to define their full-angle with a label
fr: Sélectionner deux lignes pour définir leur angle plein avec une étiquette
pt: Selecionar duas retas para definir o seu ângulo completo com etiqueta

source: Add text
fr: Ajouter du texte
pt: Adicionar texto

source: Take the intersection of two objects (circle or line)
fr: Trouver l'intersection de deux objets (cercle ou ligne)
pt: Considerar a interseção de dois objetos (circunferência ou reta)

source: Mirror a object by clicking and then click a reflection axis or point
fr: Réfléchir un objet en cliquant puis en cliquant un axe de réflexion ou un point

source: Select two points or drag a segment to construct an isosceles triangle
fr: Sélectionner deux points ou faire glisser un segment pour construire un triangle isocèle
pt: Selecionar dois pontos ou arrastar um segmento para construir um triângulo isósceles

source: Select two points or drag a segment to construct a square
fr: Sélectionnez deux points ou faites glisser un segment pour construire un carré
pt: Selecionar dois pontos ou arrastar um segmento para construir um quadrado

source: Play
fr: Lecture

source: Draw a line which is perpendicular to another line
fr: Tracer une droite perpendiculaire à une autre droite
pt: Desenhar a reta que é perpendicular a outra reta

source: Draw a line which is perp-bisect to another line
fr: Tracer une médiatrice
pt: Desenhar a reta que é a mediatriz duma outra reta

source: Draw line which is tangent to a circle
fr: Tracer une droite tangente à un cercle
pt: Desenhar a reta que é tangente a uma circunferência

source: Draw a circle by three points
fr: Tracer un cercle passant par 3 points
pt: Desenhar uma circunferência por três pontos

source: Translate
fr: Translater
pt: Traduzir

source: Zoom-in
fr: Agrandir
pt: Ampliar

source: Zoom-out
fr: Réduire
pt: Reduzir

source: snap
fr: instantané

source: grid
fr: grille
pt: grelha

source: lessGrid
fr: diminuer le nombre de cellules de la grille

source: moreGrid
fr: augmenter le nombre de cellules de la grille

source: redo
fr: refaire
pt: refazer

source: undo
fr: revenir une étape en arrière

source: ff
fr: avance rapide

source: fr
fr: Marche arrière rapide

source: play
fr: mettre en route

source: new
fr: nouveau
pt: novo

source: open
fr: ouvrir
pt: abrir

source: save
fr: sauvegarder
pt: guardar

source: move
fr: déplacer
pt: mover

source: line
fr: droite
pt: reta

source: parallel
fr: parallèle

source: perpendicular
fr: perpendiculaire

source: foot
fr: pied
pt: pé da perpendicular

source: circle
fr: cercle
pt: circunferência

source: circle3p
fr: cercle 3P
pt: circunferência3p

source: compass
fr: compas
pt: compasso

source: polygon
fr: polygone
pt: polígonno

source: text
fr: texte
pt: texto

source: intersect
fr: intersection
pt: interseta

source: reflectr
fr: réfléchir
pt: reflete

source: isosceles triangle
fr: triangle isocèle
pt: triângulo isósceles

source: midpoint
fr: milieu
pt: ponto médio

source: square
fr: carré
pt: quadrado

source: equilateral triangle
fr: triangle équilateral
pt: triângulo equilátero

source: quadrangle
fr: quadrilatère

source: pentagon
fr: pentagone
pt: pentágono

source: trapezoid
fr: trapèze
pt: trapézio

source: right angle trapezoid
fr: trapèze rectangle
pt: trapézio retângulo

source: hence
fr: donc
pt: portanto

source: Can not find image: {0}
fr: Impossible de trouver l'image : {0}
pt: Não foi possível encontrar uma imagem: {0}

source: Given:
fr: Étant donné :
pt: Dado que:

source: To Prove:
fr: À prouver :
pt: Demonstrar que:

source: In
fr: Dans
pt: Em

source: and
fr: et
pt: e

source: Similarly,
fr: De même,

source: area
fr: aire
pt: área

source: parallelogram
fr: parallélogramme
pt: paralelogramo

source: Please select two points
fr: Sélectionnez deux points
pt: Selecione dois pontos

source: Please select two segments
fr: Sélectionnez deux segments
pt: Selecione dois segmentos

source: Please select two lines
fr: Sélectionnez deux lignes
pt: Selecione duas retas

source: Please select two angles
fr: Sélectionnez deux angles
pt: Selecione dois ângulos

source: Please select two triangles
fr: Sélectionnez deux triangles
pt: Selecione dois triângulos

source: Please select three non-collinear points
fr: Sélectionnez trois points non alignés
pt: Selecione três pontos não colineares

source: Please select three points
fr: Sélectionnez trois points
pt: Selecione três pontos

source: Please select four points
fr: Sélectionnez quatre points
pt: Selecione quatro ponros

source: Please select N(>=3) points
fr: Sélectionnez N(>=3) points
pt: Selecione N(>=3) pontos

source: Can not find object icon {0}
fr: Impossible de trouver l'icône d'objet {0}
pt: Não foi possível encontrar o ícone do objeto {0}

source: Can not find file {0}
fr: Impossible de trouver le fichier {0}
pt: Não foi possível encontrar o ficheiro {0}

source: number
fr: nombre
pt: número

source: tri
fr: triangle

source: cir
fr: cercle

source: para
fr: parallèle

source: perp
fr: perpendiculaire

source: Keywords
fr: Mots-clés
pt: Palavras-chave

source: Symbol
fr: Symbole
pt: Símbolo

source: Object
fr: Objet
pt: Objeto

source: Draw
fr: Dessiner
pt: Desenho

source: Equation
fr: Équation
pt: Equação

source: Rule
fr: Règle
pt: Regra

source: Rule1
fr: Règle 1
pt: Regra1

source: Rule2
fr: Règle 2
pt: Regra2

source: Rule3
fr: Règle 3
pt: Regra3

source: SAS
fr: côté-angle-côté
pt: LAL

source: AAS
fr: angle-angle-côté
pt: AAL

source: SSS
fr: côté-côté-côté
pt: LLL

source: ASA
fr: angle-côté-angle
pt: ALA

source: Collinear
fr: Colinéaire
pt: Colinear

source: Eqdistant
fr: Équidistant

source: Cyclic
fr: Cyclique
pt: Cíclico

source: Similar
fr: Similaire
pt: Semelhante

source: Distance Less
fr: Distance inférieure

source: Angle Less
fr: Angle inférieur

source: Perp-Bisector
fr: Bissectrice perpendiculaire
pt: Mediatriz

source: Right Triangle
fr: Triangle rectangle
pt: Triângulo Retângulo

source: Iso-Right Triangle
fr: Triangle rectangle isocèle
pt: Triângulo Retângulo Isósceles

source: Between
fr: Entre
pt: Entre

source: Angle Inside
fr: Angle intérieur

source: Angle Outside
fr: Angle extérieur

source: Triangle Inside
fr: Triangle intérieur
pt: Triângulo no interior

source: Para Inside
fr: Parallèle intérieur

source: Opposite Inside
fr: Opposé intérieur

source: Same Side
fr: Même côté
pt: Mesmo lado

source: Convex
fr: Convexe
pt: Convexo

source: assertion type: {0} not defined.
fr: type d'assertion : {0} non défini.
pt: tipo de afirmação: {0} não definida.

source: No Selected
fr: Aucune sélection
pt: Não selecionado

source: Dialog
fr: Dialogue

source: No Text
fr: Pas de texte
pt: Sem texto

source: Value
fr: Valeur
pt: Valor

source: Name With Value
fr: Nom avec valeur
pt: Nome com Valor

source: Vertical Line
fr: Ligne verticale
pt: Reta Vertical

source: Horizontal Line
fr: Ligne horizontale
pt: Reta Horizontal

source: Geometry Expert
fr: Expert en géométrie

source: ALine
fr: LigneA

source: ABline
fr: LigneAB

source: Hexagon
fr: Hexagone
pt: Hexágono

source: Nteqangle
fr: AngleNteq
pt: Ângulos diferentes

source: autoshowstep
fr: affichageautomatiqueétape
pt: mostra automaticamente o passo

source: start to animate
fr: démarrer l'animation

source: Equal Angle
fr: Angle égal
pt: Ângulo Igual

source: Similiar Triangle
fr: Triangle similaire
pt: Triângulo semelhante

source: Congruent Triangle
fr: Triangle congruent
pt: Triângulo congruente

source: Bisect
fr: Bissectrice
pt: Bissectar

source: Tangent
fr: Tangente
pt: Tangente

source: Equal Product
fr: Produit égal
pt: Produto Igual

source: Ratio
fr: Rapport

source: Special Angle
fr: Angle spécial
pt: Ângulo especial

source: Angles Equation
fr: Équation d'angles
pt: Equação de ângulos

source: Segment Equation
fr: Équation de segment
pt: Equação de segmentos

source: failed
fr: échoué
pt: falhou

source: On
fr: Activé

source: Background color
fr: Couleur de fond

source: Change Color
fr: Changer la couleur
pt: Trocar cor

source: propline
fr: propligne

source: width
fr: largeur
pt: espessura

source: {0} already exists, do you want to overwrite it?
fr: {0} existe déjà, voulez-vous l'écraser ?
pt: {0} já existe. Deseja substituí-lo?

source: Can not prove this theorem with Deductive Database Method
fr: Impossible de prouver ce théorème avec la méthode de base de données déductive
pt: Não é possível provar este teorema com o método das bases de dados dedutivas

source: Can not prove this theorem.
fr: Impossible de prouver ce théorème.
pt: Impossível demonstrar este teorema.

source: Proof text
fr: Texte de la preuve
pt: Texto da demonstração

source: Author:
fr: Auteur :
pt: Autores:

source: Free Point
fr: Point libre
pt: Ponto livre

source: The coordinates
fr: Les coordonnées
pt: As coordenadas

source: The equational hypotheses:
fr: Les hypothèses en équations :
pt: As equações das hipóteses:

source: The theorem is not proved with the Deductive Database Method!
fr: Le théorème n'est pas prouvé avec la méthode de base de données déductive !
pt: O teorema não é provado com o método dedutivo de banco de dados!

source: The theorem is not proved with The Full-Angle Method.
fr: Le théorème n'est pas prouvé avec la méthode de l'angle complet.
pt: O teorema não é provado com o método do ângulo completo.

source: Use the LEFT button to select a position
fr: Utilisez le bouton GAUCHE pour sélectionner une position
pt: Use a tecla ESQUERDA para escolher uma posição

source: Select two points to determine a line
fr: Sélectionnez deux points pour déterminer une ligne
pt: Selecione dois pontos para determinar uma reta

source: Please use the menu "Action -> Animation" to define an animation first.
fr: Veuillez utiliser le menu "Action -> Animation" pour définir une animation d'abord.
pt: Primeiro use o menu "Ação -> Animação" para definir uma animação.

source: Groebner Basis Method
fr: Méthode de la base de Gröbner
pt: Método de base de Groebner

source: Because
fr: Parce que
pt: Porque

source: Hence
fr: Donc
pt: Portanto

source: Q.E.D.
fr: CQFD
pt: C.Q.D.

source: Total solutions:
fr: Nombre total de solutions :
pt: Todas as soluções:

source: Please select 3 points (0 points selected)
fr: Sélectionnez 3 points (0 points sélectionnés)
pt: Por favor selecione 3 pontos (0 pontos selecionados)

source: Can not open link {0}
fr: Impossible d'ouvrir le lien {0}
pt: Impossível abrir o link {0}

source: Construct a circle by clicking two points as radius and another point as center
fr: Construisez un cercle en cliquant sur deux points comme rayon et un autre point comme centre
pt: Construção de uma circunferência escolhendo dois pontos como raio e outro ponto como centro

source: Click a point then drag to construct a circle
fr: Cliquez sur un point puis faites-le glisser pour construire un cercle
pt: Escolha um ponto e depois arraste para construir uma circunferência

source: Adjust the speed of animation
fr: Ajuster la vitesse de l'animation
pt: Ajustar a velocidade da animação

source: Reset
fr: Réinitialiser
pt: Reiniciar

source: Start animation step by step
fr: Démarrer l'animation pas à pas
pt: Começar animação passo a passo

source: Go to the end of the proof
fr: Aller à la fin de la démonstration
pt: Ir para o final da demonstração

source: Go to the next step of the proof
fr: Passer à l'étape suivante de la démonstration
pt: Ir para o passo seguinte da demonstração

source: Unfreeze All Points
fr: Défiger tous les points

source: Do you mean...
fr: Voulez-vous dire...

source: Line {0}
fr: Droite {0}
pt: Reta {0}

source: Circle {0}
fr: Cercle {0}
pt: Circunferência {0}

source: Please draw...
fr: Dessinez...

source: {0} points left
fr: {0} points restants

source: midpoint of {0}
fr: Milieu de {0}
pt: ponto médio de {0}

source: {0} is the midpoint of {1}
fr: {0} est le milieu de {1}
pt: {0} é o ponto médio de {1}

source: with foot {0}
fr: Avec pied {0}" (used in perpendicular from a point to a line
pt: com pé da perpendicular {0}

source: Quadrangle {0}
fr: Quadrilatère {0}
pt: Quadrilátero {0}

source: Pentagon {0}
fr: Pentagone {0}
pt: Pentágono {0}

source: Hexagon {0}
fr: Hexagone {0}
pt: Hexágono {0}

source: Polygon {0}
fr: Polygone {0}
pt: Polígono {0}

source: Rhombus {0}
fr: Losange {0}
pt: Losango {0}

source: Isosceles triangle {0}
fr: Triangle isocèle {0}
pt: Triângulo isósceles {0}

source: Right triangle {0}
fr: Triangle rectangle {0}
pt: Triângulo retângulo {0}

source: Parallelogram {0}
fr: Parallélogramme {0}
pt: Paralelogramo {0}

source: Square {0}
fr: Carré {0}
pt: Quadrado {0}

source: Trapezoid {0}
fr: Trapèze {0}
pt: Trapézio {0}

source: Right trapezoid {0}
fr: Trapèze rectangle {0}
pt: Trapézio retângulo {0}

source: Equilateral triangle {0}
fr: Triangle équilatéral {0}
pt: Triângulo equilátero {0}

source: {0} is the reflection of {1} wrt {2}
fr: {0} est le symétrique de {1} par rapport à {2}
pt: {0} é a reflexão de {1} relativamente a {2}

source: Isosceles
fr: Isocèle
pt: Isósceles

source: Equilateral
fr: Équilatéral
pt: Equilátero

source: Right
fr: Rectangle
pt: Direita

source: Building GIF File
fr: Création du fichier GIF
pt: Criar ficheiro GIF

source: {0} frame(s) added
fr: {0} image(s) ajoutée(s)

source: Next
fr: Suivant
pt: Seguinte

source: Rotate
fr: Tourner
pt: Rodar

source: Flap
fr: Retourner

source: Yes
fr: Oui
pt: Sim

source: No
fr: Non
pt: Não

source: Take a point {0} on line {1} such that {2}
fr: Prenez un point {0} sur la droite {1} tel que {2}

source: Take a point {0} on circle {1} such that {2}
fr: Placez un point {0} sur le cercle {1} tel que {2}

source: Radical of {0} and {1}
fr: Radical de {0} et {1}
pt: Eixo radical de {0} e {1}

source: LRatio of {0} and {1}
fr: Rapport longueur/largeur de {0} et {1}

source: NRatio of {0} and {1}
fr: Rapport inverse des longueurs de {0} et {1}

source: PRatio of {0} and {1}
fr: Rapport de périmètre de {0} et {1}

source: TRatio of {0} and {1}
fr: Rapport d'aires de {0} et {1}

source: on line {0}
fr: sur la droite {0}
pt: na reta {0}

source: {0} is on line {1}
fr: {0} est sur la droite {1}
pt: {0} está na reta {1}
