Repository: thomiblitz/Java-Geometry-Expert
Catalog: src/main/po/*.po
Languages: fr, pt

source: {0} is parallel to {1}
fr: {0} est parallèle à {1}
pt: {0} é paralelo a {1}

source: {0} is perpendicular to {1}
fr: {0} est perpendiculaire à {1}
pt: {0} é perpendicular a {1}

source: {0} is on the perpendicular bisector of {1}
fr: {0} est sur la médiatrice de {1}
pt: {0} está na mediatriz de {1}

source: on the perpendicular bisector of {0}
fr: sur la médiatrice de {0}
pt: na mediatriz de {0}

source: on circle {0}
fr: sur le cercle {0}
pt: na circunferência {0}

source: {0} is on circle {1}
fr: {0} est sur le cercle {1}
pt: {0} está na circunferência {1}

source: circumcenter of {0}
fr: centre du cercle circonscrit à {0}
pt: circuncentro de {0}

source: {0} is the circumcenter of {1}
fr: {0} est le cercle circonscrit à {1}
pt: {0} é o circuncentro de {1}

source: incenter of {0}
fr: Centre du cercle inscrit dans {0}
pt: incentro de {0}

source: {0} is the incenter of {1}
fr: {0} est le centre du cercle inscrit dans {1}
pt: {0} é o incentro de {1}

source: orthocenter of {0}
fr: orthocentre de {0}
pt: ortocentro de {0}

source: {0} is the orthocenter of {1}
fr: {0} est l'orthocentre de {1}
pt: {0} é o ortocentro de {1}

source: centroid of {0}
fr: centroïde de {0}
pt: baricentro de {0}

source: {0} is the centroid of {1}
fr: {0} est le centroïde de {1}
pt: {0} é o baricentro de {1}

source: barycenter of {0}
fr: barycentre de {0}
pt: baricentro de {0}

source: {0} is the barycenter of {1}
fr: {0} est le barycentre de {1}
pt: {0} é o baricentro de {1}

source: {0} are collinear
fr: {0} sont colinéaires
pt: {0} são colineares

source: {0} are parallel
fr: {0} sont parallèles
pt: {0} são paralelos

source: {0} are perpendicular
fr: {0} sont perpendiculaires
pt: {0} são perpendiculares

source: {0} are concyclic
fr: {0} sont cocycliques
pt: {0} são concíclicos

source: Full
fr: Complet
pt: Completo

source: Manual
fr: Manuel

source: Search
fr: Rechercher
pt: Procurar

source: Please choose
fr: Veuillez choisir
pt: Por favor selecione

source: We could not find anything!
fr: Aucun résultat trouvé !

source: No result
fr: Aucun résultat
pt: Sem resultado

source: Press SHIFT and drag with right mouseclick to zoom, press SHIFT and drag with left mouseclick to move
fr: Appuyez sur SHIFT et faites glisser avec le clic droit pour zoomer, appuyez sur SHIFT et faites glisser avec le clic gauche pour déplacer

source: Click to see the detail
fr: Cliquez pour voir le détail
pt: Clicar para ver o detalhe

source: Rule {0} for the GDD Method
fr: Règle {0} pour la méthode GDD
pt: Regra {0} do Método GDD

source: Rule {0} for the Full Angle Method
fr: Règle {0} pour la méthode des angles complets
pt: Regra {0} do Método do ângulo Completo

source: Rule {0}
fr: Règle {0}
pt: Regra {0}

source: RULE {0}
fr: RÈGLE {0}
pt: REGRA {0}

source: rule {0}
fr: règle {0}
pt: regra {0}

source: If AB ∥ BC, then A, B and C are collinear.
fr: Si AB ∥ BC, alors A, B et C sont alignés.
pt: Se AB ∥ BC, então A, B e C são colineares.

source: For two angles ∠[l1,l2], ∠[l3,l4]. If l1 = l3 and l2 ∥ l4, then ∠[l1,l2] = ∠[l3,l4].
fr: Pour deux angles ∠[l1,l2], ∠[l3,l4]. Si l1 = l3 et l2 ∥ l4, alors ∠[l1,l2] = ∠[l3,l4].
pt: Dados dois ângulos ∠[l1,l2], ∠[l3,l4]. Se l1 = l3 e l2 ∥ l4, então ∠[l1,l2] = ∠[l3,l4].

source: For example, in parallelogram ABCD, AD ∥ BC and AC = CA, hence ∠[CAD] = ∠[ACB].
fr: Par exemple, dans le parallélogramme ABCD, AD ∥ BC et AC = CA, donc ∠[CAD] = ∠[ACB].
pt: Por exemplo, no paralelogramo ABCD, AD ∥ BC e AC = CA, portanto ∠[CAD] = ∠[ACB].

source: If AB ∥ CD and E is the intersection of AC and BD, then EA / EC = EB / ED.
fr: Si AB ∥ CD et E est l'intersection de AC et BD, alors EA / EC = EB / ED.
pt: Se AB ∥ CD e E é a interseção de AC com BD, então EA / EC = EB / ED.

source: If AB ∥ EF and CD ⊥ EF, then CD ⊥ EF.
fr: Si AB ∥ EF et CD ⊥ EF, alors CD ⊥ EF.
pt: Se AB ∥ EF e CD ⊥ EF, então CD ⊥ EF.

source: If AB ⊥ CD, then ∠[AB,CD] = [1] (or 90 degrees).
fr: Si AB ⊥ CD, alors ∠[AB,CD] = [1] (ou 90 degrés).
pt: Se AB ⊥ CD, então ∠[AB,CD] = [1] (ou 90 graus).

source: In a right triangle ACB, ∠C = [1], if E is the midpoint of AB, then E is the circumcenter of ABC with EA = EB = EC.
fr: Dans un triangle rectangle ACB, ∠C = [1], si E est le milieu de AB, alors E est le centre de cercle de ABC avec EA = EB = EC.
pt: Num triângulo retângulo ACB, ∠C = [1], se E é o ponto médio de AB, então E é o circuncentro de ABC com EA = EB = EC.

source: If AB ⊥ CD and CD ⊥ EF, then AB ∥ EF.
fr: Si AB ⊥ CD et CD ⊥ EF, alors AB ∥ EF.
pt: Se AB ⊥ CD e CD ⊥ EF, então AB ∥ EF.

source: For four points A,B,C,D, if AC ⊥ BC and AD ⊥ BD, then A,B,C,D are concyclic.
fr: Pour quatre points A,B,C,D, si AC ⊥ BC et AD ⊥ BD, alors A,B,C,D sont concycliques.
pt: Dados quatro pontos A,B,C,D, se AC ⊥ BC e AD ⊥ BD, então A,B,C,D são concíclicos.

source: For a circle c(O,AB) and a point C on circle c, if A,B,O are collinear, then AC ⊥ BC and ∠ACB = [1].
fr: Pour un cercle c(O,AB) et un point C sur le cercle c, si A,B,O sont alignés, alors AC ⊥ BC et ∠ACB = [1].
pt: Dada uma circunferência c(O,AB) e um ponto C na circunferência c, se A,B,O são colineares, então AC ⊥ BC e ∠ACB = [1].

source: If AB is the diameter of a circle and point D is on the circle, then AD ⊥ BD.
fr: Si AB est le diamètre d'un cercle et le point D est sur le cercle, alors AD ⊥ BD.
pt: Se AB é um diâmetro duma circunferência e o ponto D pertence à circunferência, então AD ⊥ BD.

source: Angle of circumference equals to half of the angle at the center.
fr: L'angle de circonférence est égal à la moitié de l'angle au centre.
pt: Um ângulo inscrito numa circunferência é igual a metade do ângulo ao centro.

source: If AB ∥ CD and A,B,C,D are concyclic, then ∠ABC = ∠DAB.
fr: Si AB ∥ parallèle à CD et A, B, C, D sont concycliques, alors ∠ABC = ∠DAB.
pt: Se AB ∥ CD e A,B,C,D são concíclicos, então ∠ABC = ∠DAB.

source: If A,B,C,D are concyclic, then ∠ADB = ∠ACB and vice versa.
fr: Si A, B, C, D sont cocycliques, alors ∠ADB = ∠ACB et vice-versa.
pt: Se A,B,C,D são concíclicos, então ∠ADB = ∠ACB e vice versa.

source: Chord tangent angle theorem.
fr: Théorème de l'angle entre tangente et corde.
pt: Teorema do ângulo de segmento.

source: A line passing the centers of two circles is perpendicular to the common chord of two circles.
fr: Une ligne passant par les centres de deux cercles ⊥ la corde commune des deux cercles.
pt: A reta que passa pelos centros de duas circunferências é perpendicular à corda comum das duas circunferências.

source: For example, given two circles C1(O,AB) and C2(O1,AB), A and B are two common points, then OO1 ⊥ AB.
fr: Par exemple, étant donné deux cercles C1(O,AB) et C2(O1,AB), A et B sont deux points communs, alors OO1 ⊥ AB.
pt: Por exemplo, dadas duas circunferências C1(O,AB) e C2(O1,AB), A e B são dois pontos comuns, então OO1 ⊥ AB.

source: The Addition for Full Angle.
fr: L'addition pour l'angle complet.

source: If ∠[l1,l2] = ∠[l3,l4] and ∠[l5,l6] = ∠[l7,l8], and l2 = l6 and l4 = l7, then ∠[l1,l4] = ∠[l5,l8].
fr: Si ∠[l1,l2] = ∠[l3,l4] et ∠[l5,l6] = ∠[l7,l8], et l2 = l6 et l4 = l7, alors ∠[l1,l4] = ∠[l5,l8].
pt: Se ∠[l1,l2] = ∠[l3,l4] e ∠[l5,l6] = ∠[l7,l8], e l2 = l6 e l4 = l7, então ∠[l1,l4] = ∠[l5,l8].

source: ASPP12
fr: Si ∠[l1,l2] = ∠[l3,l4] et l1 ∥ l2, alors l3 ∥ l4.

source: If ∠[l1,l2] = ∠[l3,l4] and l1 ∥ l2, then l3 ∥ l4.
fr: Si ∠[l1,l2] = ∠[l3,l4] et l1 ∥ l2, alors l3 ∥ l4.
pt: Se ∠[l1,l2] = ∠[l3,l4] e l1 ∥ l2, então l3 ∥ l4.

source: Because if l1 ∥ l2, then ∠[l1,l2] = [0]. Hence ∠[l3,l4] = [0].
fr: Parce que si l1 ∥ l2, alors ∠[l1,l2] = [0]. Donc ∠[l3,l4] = [0].
pt: Porque se l1 ∥ l2, então ∠[l1,l2] = [0]. Portanto ∠[l3,l4] = [0].

source: ASPP13
fr: Si ∠[l1,l2] = ∠[l3,l4] et l1 ∥ l3, alors l2 ∥ l4.

source: If ∠[l1,l2] = ∠[l3,l4] and l1 ∥ l3, then l2 ∥ l4.
fr: Si ∠[l1,l2] = ∠[l3,l4] et l1 ∥ l3, alors l2 ∥ l4.
pt: Se ∠[l1,l2] = ∠[l3,l4] e l1 ∥ l3, então l2 ∥ l4.

source: ASTT12
fr: Si ∠[l1,l2] = ∠[l3,l4] et l1 ⊥ l2, alors l3 ⊥ l4.

source: If ∠[l1,l2] = ∠[l3,l4] and l1 ⊥ l2, then l3 ⊥ l4.
fr: Si ∠[l1,l2] = ∠[l3,l4] et l1 ⊥ l2, alors l3 ⊥ l4.
pt: Se ∠[l1,l2] = ∠[l3,l4] e l1 ⊥ l2, então l3 ⊥ l4.

source: ASTT13
fr: Si ∠[l1,l2] = ∠[l3,l4] et l1 ⊥ l3, alors l2 ⊥ l4.

source: If ∠[l1,l2] = ∠[l3,l4] and l1 ⊥ l3, then l2 ⊥ l4.
fr: Si ∠[l1,l2] = ∠[l3,l4] et l1 ⊥ l3, alors l2 ⊥ l4.
pt: Se ∠[l1,l2] = ∠[l3,l4] e l1 ⊥ l3, então l2 ⊥ l4.

source: Special Angles.
fr: Angles spéciaux.
pt: Ângulos Especiais.

source: Supplementary Angle.
fr: Angle supplémentaire.
pt: Ângulo Suplementar.

source: Isosceles Triangle.
fr: Triangle Isocèle.
pt: Triângulo Isósceles.

source: Isosceles Triangle Theorem
fr: Théorème du Triangle Isocèle
pt: Teorema Triângulos isósceles

source: For an isosceles triangle ABC and a point D on line BC, if one of the following statements is true, the other two are also true:
fr: Pour un triangle isocèle ABC et un point D sur la ligne BC, si l'une des affirmations suivantes est vraie, les deux autres le sont également :
pt: Dado um triângulo isósceles ABC e um ponto D na reta BC, se uma das seguintes afirmações é verdadeira, as outras duas também são verdadeiras:

source: 1. AD ⊥ BC, 2. D is the midpoint of BC, 3. ∠BAD = ∠DAC.
fr: 1. AD ⊥ BC, 2. D est le milieu de BC, 3. ∠BAD = ∠DAC.
pt: 1. AD ⊥ BC, 2. D é o ponto médio de BC, 3. ∠BAD = ∠DAC.

source: Congruent Triangles.
fr: Triangles Congruents.
pt: Triângulos congruentes.

source: Triangles are called congruent if they have the same size and shape. That is, corresponding angles have the same measure, and corresponding sides have the same length.
fr: Les triangles sont dits congruents s'ils ont la même taille et la même forme. C'est-à-dire que les angles correspondants ont la même mesure, et les côtés correspondants ont la même longueur.
pt: Dois triângulos dizem-se congruentes de tiverem o mesmo tamanho e forma. Isto é, ângulos correspondentes têm a mesma amplitude e lados correspondentes têm o mesmo comprimento.

source: ASA (angle-side-angle) congruence.
fr: Congruence (angle-côté-angle).
pt: congruência ALA (ângulo-lado-ângulo).

source: Two triangles are congruent if a pair of corresponding angles and the included side are equal.
fr: Deux triangles sont congruents si deux couples d'angles correspondants et les côtés inclus entre eux sont égaux.
pt: Dois triângulos são congruentes se um par de ângulos correspondentes e o lado adjacente a ambos são iguais.

source: SAS (side-angle-side) congruence.
fr: Congruence (côté-angle-côté).
pt: congruência LAL (lado-ângulo-lado).

source: Two triangles are congruent if a pair of corresponding sides and the included angle are equal.
fr: Deux triangles sont congruents si deux paires de côtés correspondants et l'angle inclus entre eux sont égaux.
pt: Dois triângulos são congruentes se um par de lados correspondentes e o ângulo por eles formado forem iguais.

source: SSS (side-side-side) congruence.
fr: Congruence (côté-côté-côté).
pt: congruência LLL (lado-lado-lado).

source: Two triangles are congruent if their corresponding sides are equal.
fr: Deux triangles sont congruents si leurs côtés correspondants sont égaux.
pt: Dois triângulos são congruentes se os seus lados correspondentes forem iguais.

source: SAS (side-angle-side) congruence for right triangles.
fr: Congruence SAS (côté-angle-côté) pour les triangles droits.
pt: congruência LAL (lado-ângulo-lado) para triângulos retângulos.

source: Two right triangles are congruent if their two corresponding sides are equal.
fr: Deux triangles rectangles sont congruents si leurs deux paires de côtés de l'angle droit sont égales respectivement.
pt: Dois triângulos retângulos são congruentes se dois dos seus lados correspondentes forem iguais.

source: Similar triangles.
fr: Triangles Similaires.
pt: Triângulos semelhantes.

source: Similar triangles are triangles that have the same shape but possibly different size. In particular, corresponding angles are congruent, and corresponding sides are in proportion.
fr: Des triangles semblables sont des triangles qui ont la "même forme" mais peut-être des dimensions différentes. En particulier, les angles correspondants sont congruents, et les côtés correspondants sont proportionnels.
pt: Triângulos semelhantes são triângulos que têm a mesma forma mas podem ter um tamanho diferente. Em particular, ângulos correspondentes são congruentes e lados correspondentes são proporcionais.

source: AAA (angle-angle-angle) similarity.
fr: Similarité (angle-angle-angle).
pt: semelhança AAA (ângulo-ângulo-ângulo).

source: If two triangles have two corresponding angles that are congruent, then the triangles are similar. Because the sum of the angles in a triangle must be π, we really only need to know that two pairs of corresponding angles are congruent to know that the triangles are similar.
fr: Si deux triangles ont deux angles correspondants qui sont congruents, alors les triangles sont similaires. Parce que la somme des angles dans un triangle doit être égale à π, nous n'avons vraiment besoin de savoir que deux paires d'angles correspondants sont congruents pour savoir que les triangles sont similaires.
pt: Se dois triângulos têm os ângulos correspondentes congruentes, então os triângulos são semelhantes. Uma vez que a soma dos ângulos internos de um triângulo é igual a π, apenas é necessário que dois pares de ângulos correspondentes sejam congruentes para sabermos que os triângulos são semelhantes.

source: SAS (side-angle-side) similarity.
fr: Similarité (côté-angle-côté).
pt: semelhança LAL (lado-ângulo-lado).

source: The side-angle-side (SAS) similarity test says that if two triangles have two pairs of sides that are proportional and the included angles are congruent, then the triangles are similar.
fr: Le test de similarité (côté-angle-côté) dit que si deux triangles ont deux paires de côtés proportionnels et que les angles inclus sont congruents, alors les triangles sont semblables.
pt: O critério de semelhança Lado-Ângulo-Lado (LAL) afirma que se dois triângulos têm dois pares de lados correspondentes proporcionais e os ângulos por eles formado congruentes, então os triângulos são semelhantes.

source: SSS (side-side-side) similarity.
fr: Similarité (côté-côté-côté).
pt: semelhança LLL (lado-lado-lado).

source: If two triangles have all three pairs of sides in proportion, the triangles are similar.
fr: Si deux triangles ont toutes les trois paires de côtés proportionnelles, les triangles sont similaires.
pt: Se dois triângulos têm os três pares de lados correspondentes proporcionais, então os triângulos são semelhantes.

source: Ratio by similarity.
fr: Rapport par similarité.
pt: Proporcional por semelhança.

source: Middle Connection Theorem for Triangles.
fr: Théorème de la connexion médiane pour les triangles.
pt: Teorema da Base Média do Triângulo.

source: The line connects the midpoints of two sides of a triangle is parallel to the third side of the triangle.
fr: La droite qui passe par les milieux de deux côtés d'un triangle est parallèle au troisième côté du triangle.
pt: A reta que contém os pontos médios de dois lados de um triângulo é paralela ao terceiro lado do triângulo.

source: The hypotenuse of a right triangle is the diameter of the circumscribed circle of the triangle, and the midpoint of the hypotenuse is the center of the circle.
fr: L'hypoténuse d'un triangle droit est le diamètre du cercle circonscrit du triangle, et le milieu de l'hypoténuse est le centre du cercle.
pt: A hipotenusa dum triângulo retângulo é o diâmetro da circunferência circunscrita ao triângulo, e o ponto médio da hipotenusa é o centro dessa circunferência.

source: For a right triangle ACB, if AC ⊥ BC and D is the midpoint of AB, then DC = DA = DB, D is the center of circle ABC.
fr: Pour un triangle rectangle ACB, si AC ⊥ BC et que D est le milieu de AB, alors DC = DA = DB, D est le centre du cercle ABC.
pt: Num triângulo retângulo ACB, se AC ⊥ BC e D é o ponto médio de AB, então DC = DA = DB, D é o centro da circunferência ABC.

source: Equilateral Triangles.
fr: Triangles équilatéraux.
pt: Triângulos equiláteros.

source: An equilateral triangle is a triangle in which all three sides have equal lengths.
fr: Un triangle équilatéral est un triangle dont tous les troi
pt: Um triângulo equilátero é um triângulo em que os três lados têm o mesmo comprimento.

source: Pythagorean Theorem.
fr: Théorème de Pythagore.
pt: Teorema de Pitágoras.

source: In any right triangle, the area of the square whose side is the hypotenuse (the side of a right triangle opposite the right angle) is equal to the sum of areas of the squares whose sides are the two legs (i.e. the two sides other than the hypotenuse).
fr: Dans tout triangle rectangle, la surface du carré dont le côté est l'hypoténuse (le côté du triangle rectangle opposé à l'angle droit) est égale à la somme des surfaces des carrés dont les côtés sont les deux jambes (c'est-à-dire les deux côtés autres que l'hypoténuse).
pt: Num triângulo retângulo, a área do quadrado cujo lado é a hipotenusa (o lado do triângulo retângulo oposto ao ângulo reto) é igual à soma das áreas dos quadrados cujos lados são os dois catetos (i.e. os dois lados que não são a hipotenusa).

source: The sum of three interior angles of a triangle is [0] (or 180 degree for traditional angles).
fr: La somme des trois angles intérieurs d'un triangle est de [0] (ou 180 degrés pour les angles traditionnels).
pt: A soma dos ângulos internos de um triângulo é [0] (ou 180 graus para ângulos tradicionais).

source: Parallelogram.
fr: Parallélogramme.
pt: Paralelogramo.

source: A parallelogram is a quadrilateral with two sets of opposite parallel sides.
fr: Un parallélogramme est un quadrilatère avec deux ensembles de côtés parallèles opposés.
pt: Um paralelogramo é um quadrilátero com dois pares de lados opostos paralelos.

source: Middle Connection Theorem for Trapezoid.
fr: Théorème des milieux pour un trapèze.
pt: Teorema da Base Média do Trapézio.

source: Ratio.
fr: Rapport.

source: Use Ratio in Deductive Database Method.
fr: Utiliser le rapport dans la méthode de base de données déductive.

source: Ratio by angle bisector.
fr: Rapport par bissectrice d'angle.

source: In triangle ABC, if AD is the bisector of angle A, and D is on line BC, then AB/BD = AC/DC.
fr: Dans le triangle ABC, si AD est la bissectrice de l'angle A et que D est sur la ligne BC, alors AB/BD = AC/DC.
pt: No triângulo ABC, se AD é a bissetriz do ângulo A, e D está na reta BC, então AB/BD = AC/DC.

source: Rules related to parallel lines
fr: Règles relatives aux lignes parallèles
pt: Regras relacionadas com retas paralelas

source: Rules related to perpendicular lines
fr: Règles relatives aux lignes perpendiculaires
pt: Regras relacionadas com retas perpendiculares

source: Rules related to circles
fr: Règles relatives aux cercles
pt: Regras relacionadas com circunferências

source: Rules related to angles
fr: Règles relatives aux angles
pt: Regras relacionadas com ângulos

source: Rules related to triangles
fr: Règles relatives aux triangles
pt: Regras relacionadas com triângulos

source: Other rules
fr: Autres règles
pt: Outras regras

source: The Definition of Full Angle
fr: La définition de l'angle plein
pt: A definição de ângulo completo

source: A full angle is defined as an ordered pair of two lines u and v denoted by ∠[u,v].
fr: Un angle plein est défini comme une paire ordonnée de deux lignes u et v notée par ∠[u,v].
pt: Um ângulo completo é definido por um par ordenado de duas retas u e v, e é designado por ∠[u,v].

source: ∠[u,v] = ∠[0] if and only if u ∥ v (including u = v).
fr: ∠[u,v] = ∠[0] si et seulement si u ∥ v (y compris u = v).
pt: ∠[u,v] = ∠[0] se e só se u ∥ v (inclusive u = v).

source: ∠[u,v] = ∠[1] if and only if u ⊥ v.
fr: ∠[u,v] = ∠[1] si et seulement si u ⊥ à v.
pt: ∠[u,v] = ∠[1] se e só se u ⊥ v.

source: Addition of Full Angles
fr: Addition des angles complets
pt: Adição de Ângulos Completos

source: ∠[u,s] + ∠[s,v] = ∠[u,v]. This rule is to split an angle into two or more angles.
fr: ∠[u,s] + ∠[s,v] = ∠[u,v]. Cette règle permet de diviser un angle en deux ou plusieurs angles.
pt: ∠[u,s] + ∠[s,v] = ∠[u,v]. Esta regra consiste em dividir um ângulo em dois ou mais ângulos.

source: For example, for any line m, we have ∠[u,v] = ∠[u,m] + ∠[m,v].
fr: Par exemple, pour toute droite m, nous avons ∠[u,v] = ∠[u,m] + ∠[m,v].

source: If l ⊥ v or ∠[l,v] = ∠[1], then ∠[u,v] = ∠[u,l] + ∠[l,v] = ∠[u,l] + ∠[1].
fr: Si l ⊥ v ou ∠[l,v] = ∠[1], alors ∠[u,v] = ∠[u,l] + ∠[l,v] = ∠[u,l] + ∠[1].
pt: Se l ⊥ v ou ∠[l,v] = ∠[1], então ∠[u,v] = ∠[u,l] + ∠[l,v] = ∠[u,l] + ∠[1].

source: For example, if we have AC ⊥ BC, then ∠[CBA] = ∠[BAC] + ∠[1].
fr: Par exemple, si nous avons AC ⊥ BC, alors ∠[CBA] = ∠[BAC] + ∠[1].
pt: Por exemplo, se temos AC ⊥ BC, então ∠[CBA] = ∠[BAC] + ∠[1].

source: The Isosceles Triangle Theorem for Full Angle.
fr: Le théorème du triangle isocèle pour l'angle complet.

source: If AC = BC, we have ∠[ABC] = ∠[CAB]. Conversely, if ∠[ABC] = ∠[CAB], then AB = AC or A, B and C are collinear.
fr: Si AC = BC, nous avons ∠[ABC] = ∠[CAB]. Inversement, si ∠[ABC] = ∠[CAB], alors AB = AC ou A, B et C sont alignés.
pt: Se AC = BC, tem-se ∠[ABC] = ∠[CAB]. Reciprocamente, se ∠[ABC] = ∠[CAB], então AB = AC ou A, B e C são colineares.

source: The Inscribed Angle Theorem.
fr: Le Théorème de l'Angle Inscrit.
pt: Teorema do Ângulo Inscrito.

source: Points A,B,C and D are concyclic if and only if ∠[ACB] = ∠[ADB].
fr: Les points A, B, C et D sont concycliques si et seulement si ∠[ACB] = ∠[ADB].
pt: Os pontos A,B,C e D são concíclicos se e só se ∠[ACB] = ∠[ADB].

source: If A,B,M,N are concyclic, then ∠[AB, AM] = ∠[BN,NM]. Hence we have ∠[AB, CD] = ∠[AB, AM] + ∠[AM, CD] = ∠[BN,NM] + ∠[AM, CD].
fr: Si A, B, M et N sont concycliques, alors ∠[AB, AM] = ∠[BN,NM]. Donc nous avons ∠[AB, CD] = ∠[AB, AM] + ∠[AM, CD] = ∠[BN,NM] + ∠[AM, CD].
pt: Se A,B,M,N são concíclicos, então ∠[AB, AM] = ∠[BN,NM]. Portanto tem-se ∠[AB, CD] = ∠[AB, AM] + ∠[AM, CD] = ∠[BN,NM] + ∠[AM, CD].

source: Rule 10.
fr: Règle 10.
pt: Regra 10.

source: If AB is the diameter of the circumcircle of triangle ABC and D is on the circumcircle, then for any line FG, we have ∠[CD,FG] = ∠[DBA] + ∠[ACB] + ∠[BC, FG].
fr: Si AB est le diamètre du cercle circonscrit du triangle ABC et que D est sur le cercle circonscrit, alors pour toute droite FG, nous avons ∠[CD,FG] = ∠[DBA] + ∠[ACB] + ∠[BC, FG].
pt: Se AB é o diâmetro da circunferência circunscrita ao triângulo ABC e D pertence à circunferência circunscrita, então para qualquer reta FG, tem-se ∠[CD,FG] = ∠[DBA] + ∠[ACB] + ∠[BC, FG].

source: If O is the intersection of circle (O1,OP1P3I) and circle (O2,OP2P4J) and O,I,J are collinear, then ∠[P1O, OP2] = ∠[P1P2, IP3] + ∠[JP4, P2P4].
fr: Si O est l'intersection du cercle (O1,OP1P3I) et du cercle (O2,OP2P4J) et que O, I et J sont alignés, alors ∠[P1O, OP2] = ∠[P1P2, IP3] + ∠[JP4, P2P4].
pt: Se O é a interseção da circunferência (O1,OP1P3I) com a circunferência (O2,OP2P4J) e O,I,J são colineares, então ∠[P1O, OP2] = ∠[P1P2, IP3] + ∠[JP4, P2P4].

source: If O is the circumcenter of triangle ABC, then ∠[BOC] = 2 · ∠[BAC].
fr: Si O est le centre du cercle circonscrit du triangle ABC, alors ∠[BOC] = 2 · ∠[BAC].
pt: Se O é o circuncentro do triângulo ABC, então ∠[BOC] = 2 · ∠[BAC].

source: For a circle (O,ABCD), if O is the intersection of AD and BC, then ∠[AOB] = 2 · ∠[CDA].
fr: Pour un cercle (O,ABCD), si O est l'intersection de AD et BC, alors ∠[AOB] = 2 · ∠[CDA].
pt: Dada uma circunferência (O,ABCD), se O é a interseção de AD com BC, então ∠[AOB] = 2 · ∠[CDA].

source: For a circle (O,AB), O is the center of circle, we have ∠[OAB] = ∠[ABO].
fr: Pour un cercle (O,AB), O est le centre du cercle, nous avons ∠[OAB] = ∠[ABO].
pt: Dada uma circunferência (O,AB), O é o centro da circunferência, tem-se ∠[OAB] = ∠[ABO].
